# task 01 == Виправте синтаксичні помилки
print("Hello", end = " ")
print("world!")

# task 02 == Виправте синтаксичні помилки
hello = "Hello"
world = "world"
if True:
    print(f"{hello} {world}!")

# task 03  == Вcтавте пропущену змінну у ф-цію print
for letter in "Hello world!":
    print(letter)

# task 04 == Зробіть так, щоб кількість бананів була
# завжди в чотири рази більша, ніж яблук
apples = 2
banana = apples * 4

# task 05 == виправте назви змінних
storona_1 = 1 #_storona також було б коректно
storona_2 = 2
storona_3 = 3 #сторона_3 коректна змінна, але у професійному коді бажано використовувати англійські назви
storona_4 = 4

# task 06 == Порахуйте периметр фігури з task 05
# та виведіть його для користувача
perimetery = storona_1 + storona_2 + storona_3 + storona_4
print(perimetery)


"""
    # Задачі 07 -10:
    # Переведіть задачі з книги "Математика, 2 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в другому класі
"""
# task 07

apple_tree = 4
pear_tree = apple_tree + 5
plum_tree = apple_tree - 2
sum_tree = apple_tree + pear_tree + plum_tree
print("Всього дерев посадили в саду:", sum_tree)
"""
У саду посадили 4 яблуні. Груш на 5 більше яблунь, а слив - на 2 менше.
Скільки всього дерев посадили в саду?


"""

# task 08
morning_temp = 5
lunch_temp = morning_temp - 10
evening_temp = lunch_temp + 4
print("Надвечір температура:", evening_temp)
"""
До обіда температура повітря була на 5 градусів вище нуля.
Після обіду температура опустилася на 10 градусів.
Надвечір потепліло на 4 градуси. Яка температура надвечір?
"""

# task 09
boys = 24
girls = boys / 2
sick_leave = 1
day_off = 2
available = boys + girls - sick_leave - day_off
print("Сьогодні дітей у театральному гуртку: ", available)
"""
Взагалі у театральному гуртку - 24 хлопчики, а дівчаток - вдвічі менше.
1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.
Скількі сьогодні дітей у театральному гуртку?
"""

# task 10
book1 = 8
book2 = book1 + 2
book3 = (book1 + book2) / 2
book_sum = book1 + book2 + book3
print("Усі книги по одному примірнику будуть коштувати", book_sum)
"""
Перша книжка коштує 8 грн., друга - на 2 грн. дороже,
а третя - як половина вартості першої та другої разом.
Скільки будуть коштувати усі книги, якщо купити по одному примірнику?
"""
